#+title: Emacs Config
#+author: kimothy
#+roam_tags: emacs

* Key-Bindings
  #+begin_src emacs-lisp
    (global-set-key (kbd "C-x C-r") 'rename-current-buffer-file)
    (global-set-key (kbd "C-+") 'text-scale-increase)
    (global-set-key (kbd "C--") 'text-scale-decrease)
    (global-set-key [f9] 'deft)
    (global-set-key [f12] (find-file  "~/.emacs.d/config.org")
  #+end_src

  #+RESULTS:
  | find-file | ~/.emacs.d/config.org |
